public/phases/PublicTestnet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-07 Wed 17:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Public Test Net Roadmap</title>
<meta name="author" content="Dowland Aiello" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../theme/rethink.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Public Test Net Roadmap</h1>

<div id="outline-container-org4460c0c" class="outline-2">
<h2 id="org4460c0c"><span class="todo TODO">TODO</span> Public Test Net <code>[0/3]</code></h2>
<div class="outline-text-2" id="text-org4460c0c">
<ul class="org-ul">
<li><i>ETA: Q2 2023</i></li>
</ul>
</div>

<div id="outline-container-org4e4d13d" class="outline-3">
<h3 id="org4e4d13d"><span class="todo TODO">TODO</span> Cash Bug Bounties</h3>
<div class="outline-text-3" id="text-org4e4d13d">
<p>
Use dework, and alternative platforms, like gitcoin, to set bounties for known, and unknown bugs. Estimated budget up to $5,000.
</p>
</div>
</div>
<div id="outline-container-orgb3fa591" class="outline-3">
<h3 id="orgb3fa591"><span class="todo TODO">TODO</span> Gamified Achievement System</h3>
<div class="outline-text-3" id="text-orgb3fa591">
<p>
As an alternative to cash bug bounties, award NFT-like achievements to early Vision adopters for contributions including, but not limited to:
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Participating in the Vision Public Beta</li>
<li class="off"><code>[&#xa0;]</code> Submitting a verified bug report</li>
<li class="off"><code>[&#xa0;]</code> Creating a DAO on the Vision Public Beta</li>
</ul>

<p>
These achievements will be displayed as badges via a Vision module that can be consumed by Vision OS layouts. Will be enabled by default in the Vision <a href="VisionOS.html#orgdd5d109">playful vision layout</a>. Badges will be tradable on public marketplaces if users wish to monetize their accomplishments.
</p>
</div>
</div>
<div id="outline-container-org8a26395" class="outline-3">
<h3 id="org8a26395"><span class="todo TODO">TODO</span> Developer Support</h3>
<div class="outline-text-3" id="text-org8a26395">
<p>
Offer support on Vision forums, including Discord, and Vision itself, for developers and DAO participants on Vision.
</p>
</div>

<div id="outline-container-org8c8bc3a" class="outline-4">
<h4 id="org8c8bc3a"><span class="todo TODO">TODO</span> Hackathon</h4>
<div class="outline-text-4" id="text-org8c8bc3a">
<p>
Host at least one hackathon during the Vision Public Test Net launch featuring workshops, presentations from Vision itself, workshops for how to use Vision, and demonstrations from Vision community members. Host presentations, and judging to dole out cash prizes for designated Vision DAO themes: community impact DAO's, education DAO's, and governance DAO's, for example.
</p>
</div>
</div>

<div id="outline-container-org51921f6" class="outline-4">
<h4 id="org51921f6"><span class="todo TODO">TODO</span> Digital Dev Outreach</h4>
<div class="outline-text-4" id="text-org51921f6">
<ul class="org-ul">
<li>Live Q&amp;A sessions</li>
<li>Office hours on digital platforms, including Discord</li>
<li>Responsive support on GitHub issues, Discord, and on Vision itself
<ul class="org-ul">
<li>Vision Community DAO to organize efforts</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 06/22/2022</p>
<p class="author">Author: Dowland Aiello</p>
<p class="date">Created: 2022-12-07 Wed 17:13</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
